import math

# Список слов для чисел от 0 до 19
ones = [
    "ноль",
    "один",
    "два",
    "три",
    "четыре",
    "пять",
    "шесть",
    "семь",
    "восемь",
    "девять",
    "десять",
    "одиннадцать",
    "двенадцать",
    "тринадцать",
    "четырнадцать",
    "пятнадцать",
    "шестнадцать",
    "семнадцать",
    "восемнадцать",
    "девятнадцать",
]

# Список слов для десятков
tens = [
    "",
    "",
    "двадцать",
    "тридцать",
    "сорок",
    "пятьдесят",
    "шестьдесят",
    "семьдесят",
    "восемьдесят",
    "девяносто",
]

number = input("Введите число от 0 до 99:")  # Ввод числа
num = int(number)  # Преобразовываем строку в число
# Корректность ввода
if not 0 <= num <= 99:
    print("Ошибка! Введите число от 0 до 99.")
else:
    # Определяем десяток и единицу
    ones_digit = num % 10  # % остаток от деления
    tens_digit = num // 10  # // возвращает целую часть результата деления

    if num < 20:
        result = ones[num]
    else:
        result = tens[tens_digit]
        if ones_digit != 0:
            result += f" {ones[ones_digit]}"

    print(result)
